In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df[['age', 'pclass']].isnull().sum()

age       177
pclass      0
dtype: int64

In [4]:
df_clean = df.dropna(subset=['age', 'pclass'])

In [8]:
# Group by 'pclass' and compute summary statistics for 'age'
grouped_stats = df_clean.groupby('pclass')['age'].agg(
    Mean='mean',
    Median='median',
    Minimum='min',
    Maximum='max',
    Std_Dev='std'
)

grouped_stats

             Mean  Median  Minimum  Maximum    Std_Dev
pclass
1       38.233441    37.0     0.92     80.0  14.802856
2       29.877630    29.0     0.67     70.0  14.001077
3       25.140620    24.0     0.42     74.0  12.495398

In [9]:
grouped_ages = df_clean.groupby('pclass')['age'].apply(list)
grouped_ages

pclass
1    [38.0, 35.0, 54.0, 58.0, 28.0, 19.0, 40.0, 28....
2    [14.0, 55.0, 35.0, 34.0, 66.0, 27.0, 3.0, 29.0...
3    [22.0, 26.0, 35.0, 2.0, 27.0, 4.0, 20.0, 39.0,...
Name: age, dtype: object